# Интересное сложение
# Один малыш из детского сада услышал от старшей сестры о некоем действии с числами — сложении.
# И как это часто бывает — он не до конца разобрался, как работает сложение. Например, не совсем понял,
# как произвести перенос разряда.
# Теперь он хочет научить сложению остальных ребят и просит написать программу, которая поможет ему в
# качестве наглядного материала.
#
# Формат ввода
# В первой и второй строках записаны натуральные числа меньше 1000.
#
# Формат вывода
# Одно число — результат сложения введённых чисел без учёта переносов.
# 123
# 99


p_n1 = int(input())
p_n2 = int(input())

p_n1_1 = p_n1 // 100
p_n1_2 = p_n1 // 10 - p_n1_1 * 10
p_n1_3 = p_n1 - p_n1_1 * 100 - p_n1_2 * 10

p_n2_1 = p_n2 // 100
p_n2_2 = p_n2 // 10 - p_n2_1 * 10
p_n2_3 = p_n2 - p_n2_1 * 100 - p_n2_2 * 10

p_s_1 = (p_n1_1 + p_n2_1) % 10
p_s_2 = (p_n1_2 + p_n2_2) % 10
p_s_3 = (p_n1_3 + p_n2_3) % 10
print(p_s_1 * 100 + p_s_2 * 10 + p_s_3)